class 配置:
    """
    戳一戳插件配置文件
    可以直接修改这里的值
    注意格式，用英文符号
    用元组或列表都可以，我是完美主义者，为了稍微提升运行时性能，虽然不多
    直接用py文件比用json等更便利，跟编辑自家代码一模一样
    """
    被戳回复语 = (
        "戳我干嘛呀",
        "怎么啦",
        "喵～",
        "不要戳我啊",
        "有什么事吗？",
        "别戳啦~"
    )

    #关键词，随机次数范围
    普通 = {
        "攻击": (2, 3),
        "猛攻": (3, 4),
        "戳": (1, 3),
        "猛揍": (5, 6),
        "狂揍": (5, 6),
        "揍他": (5, 6)
    }

    不回复关键词 = (
        "猛揍",
        "狂揍",
        "揍他"
    )  
    
    
    管理员限定 = {
        "肘击": (7, 8),
        "撞死他": (9, 18),
        "创死他": (9, 18),
        "撞大运": (16, 24),
        "揍死他": (24, 36),
        "限流": (36, 48),
        "一键限流": (36, 48)
    }

    彩蛋 = {
        "亲亲": (52, 52),
        "抱抱": (38, 38),
        "贴贴": (18, 18)
    }

    关键词次数 = 普通 | 管理员限定 | 彩蛋  #合并字典，便于获取次数

    冷却话语 = (
        "我戳手疼了，晚点再玩嘛。",
        "够啦够啦，歇会再玩",
        "不戳啦，歇一会吧"
    )

    不要戳自己语句 = (
        "だめですよ！",
        "让你戳了吗",
        "别让我自己戳自己啦，很奇怪的。",
        "我才不要自己戳自己呢。"
    )

    戳前自嗨语 = (
        "收到收到，马上发动攻击！",
        "好嘞，准备出击！",
        "没问题，我这就去戳戳Ta！",
        "收到收到！"
    )

    管理员语句 = (
        "对方已被击灭",
        "成功击灭对方",
        "对方被你打倒啦",
        "对方认输了"
    )

    戳完回复语 = (
        "我厉害叭～",
        "搞定咯"
    )

    遵命语 = (
        "收到！管理员大大～这就安排！✨",
        "收到管理员的指令，保证完成任务",
        "遵命，管理员大大"

    ) + 戳前自嗨语  #每次都是遵命语不好看的
